### **EXPLORATORY DATA ANALYSIS**

#### BASIC 10 STEPS

In [1]:
import pandas as pd 
import seaborn as sns
import matplotlib.pyplot as plt
import numpy as np

In [2]:
# Load Dataset 
df=sns.load_dataset('titanic')
df1=sns.load_dataset('tips')

In [6]:
# Step -1 Data Shape
from pyparsing import col


print(df.shape)
row,col=df.shape
print("Rows:",row,"Columns:",col)

(891, 15)
Rows: 891 Columns: 15

In [7]:
# Step -2 Data Info
print(df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.7+ KB
None

In [8]:
# Step -3 Find Missing Values
print(df.isnull().sum())

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

In [12]:
# percentage of missing values
#print(df.isnull().sum()/len(df)*100)
print(df1.isnull().sum()/len(df1)*100)

total_bill    0.0
tip           0.0
sex           0.0
smoker        0.0
day           0.0
time          0.0
size          0.0
dtype: float64

In [14]:
# Step -4 Split Data for new columns 
city=pd.DataFrame(np.array([["Lahore,Pakistan",67,100],["Beijing,China",5,16],["Berlin,Germany",40,50]]),columns=["Address","Males","Females"])
city

           Address Males Females
0  Lahore,Pakistan    67     100
1    Beijing,China     5      16
2   Berlin,Germany    40      50

In [17]:
city[["City","Country"]]=city['Address'].str.split(',',expand=True)
city

           Address Males Females     City   Country
0  Lahore,Pakistan    67     100   Lahore  Pakistan
1    Beijing,China     5      16  Beijing     China
2   Berlin,Germany    40      50   Berlin   Germany

In [19]:
# Step -5 Conversion Of Data types 
city.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 5 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Address  3 non-null      object
 1   Males    3 non-null      object
 2   Females  3 non-null      object
 3   City     3 non-null      object
 4   Country  3 non-null      object
dtypes: object(5)
memory usage: 248.0+ bytes

In [20]:
city[['Males','Females']]= city[['Males','Females']].astype('int64')
city.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 5 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Address  3 non-null      object
 1   Males    3 non-null      int64
 2   Females  3 non-null      int64
 3   City     3 non-null      object
 4   Country  3 non-null      object
dtypes: int64(2), object(3)
memory usage: 248.0+ bytes

In [21]:
city[['City','Country']]= city[['City','Country']].astype('str ')
city.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 5 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Address  3 non-null      object
 1   Males    3 non-null      int64
 2   Females  3 non-null      int64
 3   City     3 non-null      object
 4   Country  3 non-null      object
dtypes: int64(2), object(3)
memory usage: 248.0+ bytes